Repository: ArkDeck/ArkDeck
Catalog: ArkDeckApp/Resources/DiagnosticsLocalizable.xcstrings
Source language: en
Languages: zh_hans

# diagnostics.alignment.calibrated
source: Calibrated
zh_hans: 已校准

# diagnostics.alignment.cannotAlign
source: Cannot align
zh_hans: 无法对齐

# diagnostics.alignment.explain
source: Marks are host time. Without a calibration nothing here can be lined up against what the device recorded.
zh_hans: 标记走的是主机时间。没有校准，这里的任何东西都无法与设备记录的内容对齐。

# diagnostics.alignment.sameClock
source: One clock
zh_hans: 同一时钟

# diagnostics.capture.arm
source: Start session
zh_hans: 开始采集

# diagnostics.capture.mark
source: Mark (⌘M)
zh_hans: 打标记（⌘M）

# diagnostics.mark.auto
source: Found
zh_hans: 自动标记

# diagnostics.mark.manual
source: Marked
zh_hans: 手动标记

# diagnostics.marks.empty
source: Nothing was marked in this session.
zh_hans: 这次会话没有任何标记。

# diagnostics.marks.title
source: Marks
zh_hans: 标记

# diagnostics.missing.title
source: Missing products
zh_hans: 缺失的产物

# diagnostics.notDerived.detail
source: These marker kinds were never derived, so their absence says nothing about the run.
zh_hans: 这些标记种类从未被反推，所以它们的缺席不说明这次运行发生了什么。

# diagnostics.notDerived.title
source: Not looked for
zh_hans: 未检查的种类

# diagnostics.partial
source: Partial
zh_hans: 不完整

# diagnostics.partial.detail
source: This session is missing a product it declared.
zh_hans: 这次会话缺少它自己声明过的产物。

# diagnostics.selection.driftedAway
source: the cursor has left this event
zh_hans: 光标已离开该事件

# diagnostics.selection.timeOnly
source: Only a time point is selected
zh_hans: 当前仅选择了时间点

# diagnostics.session.none
source: No session open
zh_hans: 尚无诊断会话

# diagnostics.session.none.detail
source: Open a capture.diagnostics Job from History to read its verified artifacts. No connected device is needed to read a saved capture.
zh_hans: 从 History 打开 capture.diagnostics 记录，读取校验后的产物。读取已保存的采集无需连接设备。

# diagnostics.shot.failed
source: The capture failed
zh_hans: 截图失败

# diagnostics.shot.none
source: No screenshot was taken here
zh_hans: 此处未拍摄截图

# diagnostics.shot.standsFor
source: A screenshot stands for the moment it was taken, not the moment it was asked for.
zh_hans: 截图只代表拍摄时刻，不代表标记时刻的画面。

# diagnostics.shot.takenAfter
source: taken after the mark
zh_hans: 拍摄于标记之后

# diagnostics.shot.tooFar
source: No picture proves this moment
zh_hans: 这一时刻没有可证明对应的画面

# diagnostics.shot.tooFar.detail
source: The nearest screenshot is too far from this mark to stand for it.
zh_hans: 最近的一张截图距这个标记太远，不能代表它。

# diagnostics.shot.undecidable
source: Nothing here can tell
zh_hans: 此处无法判定

# diagnostics.shot.undecidable.detail
source: A screenshot was taken around this mark, but the interval it could have been taken in is wider than the tolerance, so it cannot be said to be this moment.
zh_hans: 这个标记附近确有一张截图，但它可能被拍摄的时间区间宽于容差，因此无法断定它就是这一时刻。

# diagnostics.session.loading
source: Reading session artifacts…
zh_hans: 正在读取会话产物…

# diagnostics.session.failed
source: Cannot read this session
zh_hans: 无法读取此会话

# diagnostics.session.retry
source: Retry reading
zh_hans: 重新读取

# diagnostics.session.reload
source: Reload session
zh_hans: 重新加载会话

# diagnostics.session.readOnly
source: Saved capture · read only. Viewing does not start a new Job.
zh_hans: 已保存的采集 · 只读。查看不会启动新 Job。

# diagnostics.session.timeline
source: Runtime timeline
zh_hans: Runtime 时间线

# diagnostics.ring.covered
source: Runtime found the coverage anchor in the ring snapshot.
zh_hans: Runtime 已在环形快照中找到覆盖锚点。

# diagnostics.ring.lost
source: The ring snapshot lost its coverage anchor. Earlier events may be missing.
zh_hans: 环形快照未保留覆盖锚点，较早事件可能缺失。

# diagnostics.artifacts.title
source: Session artifacts
zh_hans: 会话产物

# diagnostics.artifacts.privacy
source: Text previews stay in this App. Sensitive content is read only when you select it; nothing is exported or uploaded.
zh_hans: 文本预览仅留在此 App。敏感内容仅在选择后读取，不会导出或上传。

# diagnostics.artifacts.read
source: Read locally
zh_hans: 在本机读取

# diagnostics.artifacts.readSensitive
source: Read sensitive content locally
zh_hans: 在本机读取敏感内容

# diagnostics.artifacts.openElsewhere
source: A published Trace can open in Trace Viewer. Other files can be exported explicitly from History. Job times are never used as screenshot timestamps.
zh_hans: 已发布的 Trace 可在 Trace Viewer 打开；其他文件可从 History 显式导出。不会使用 Job 时间推算截图时刻。

# diagnostics.preview.clipped
source: Preview shows the first 120,000 characters. Export the artifact from History to read the complete file.
zh_hans: 预览显示前 120,000 个字符。可从 History 导出产物以读取完整文件。

# diagnostics.mark.timeMissing
source: Time not reported
zh_hans: 未记录时刻

# diagnostics.artifacts.openTrace
source: Open sensitive Trace in Viewer
zh_hans: 在 Viewer 中打开敏感 Trace

# diagnostics.artifacts.openTrace.privacy
source: Reads the selected Job’s immutable Trace into the local viewer cache. No upload.
zh_hans: 将所选 Job 的不可变 Trace 读取到本机查看器缓存，不上传。

# diagnostics.preview.invalidStructuredText
source: This structured text is not valid UTF-8. Inspect or export the original Artifact from History.
zh_hans: 这份结构化文本不是有效 UTF-8。请在 History 中检查或导出原始 Artifact。

# diagnostics.hilog.title
source: HiLog summary
zh_hans: HiLog 摘要

# diagnostics.hilog.failed
source: Unable to verify the HiLog summary
zh_hans: 无法核验 HiLog 摘要

# diagnostics.hilog.failed.detail
source: Return to History to inspect this Job and its Artifacts. Reload to try reading the same record again.
zh_hans: 请返回 History 检查此 Job 与 Artifact；重新加载只会重读同一记录。

# diagnostics.hilog.readOnly
source: Read-only view of the saved summary. Opening or reloading it does not run another analysis.
zh_hans: 只读查看已保存的摘要。打开或重新加载不会再次执行分析。

# diagnostics.hilog.coverage.complete
source: All nonblank line headers recognized
zh_hans: 全部非空行的行首已识别

# diagnostics.hilog.coverage.partial
source: Some line headers unrecognized
zh_hans: 部分行首未识别

# diagnostics.hilog.coverage.unrecognized
source: No line headers recognized
zh_hans: 没有识别到行首

# diagnostics.hilog.coverage.empty
source: No nonblank lines
zh_hans: 没有非空行

# diagnostics.hilog.coverage.detail
source: These counts describe default HiLog line headers only. They do not prove capture completeness, valid body encoding, absence of faults or device health.
zh_hans: 这些统计仅描述默认 HiLog 行首；不证明采集完整、正文编码有效、没有故障或设备健康。

# diagnostics.hilog.lines
source: Physical lines
zh_hans: 物理行数

# diagnostics.hilog.level.D
source: D · Debug
zh_hans: D · 调试

# diagnostics.hilog.level.I
source: I · Info
zh_hans: I · 信息

# diagnostics.hilog.level.W
source: W · Warning
zh_hans: W · 警告

# diagnostics.hilog.level.E
source: E · Error
zh_hans: E · 错误

# diagnostics.hilog.level.F
source: F · Fatal
zh_hans: F · 致命

# diagnostics.hilog.unrecognized
source: Unrecognized lines
zh_hans: 未识别行数

# diagnostics.hilog.blank
source: Blank lines
zh_hans: 空行数

# diagnostics.hilog.source
source: Recorded source
zh_hans: 已记录来源

# diagnostics.hilog.source.detail
source: The source Artifact ID matches the Job input. The source hash and size are recorded by the analyzer; this view does not read the raw log or verify it again. Export the summary from History.
zh_hans: 来源 Artifact 标识与 Job 输入一致。来源哈希与大小来自分析器记录；此页面不会读取或重新核验原始日志。可从 History 导出摘要。

# diagnostics.hilog.sourceJob
source: Source Job
zh_hans: 来源 Job

# diagnostics.hilog.sourceArtifact
source: Source Artifact
zh_hans: 来源 Artifact

# diagnostics.hilog.sourceBytes
source: Recorded source bytes
zh_hans: 已记录来源字节数

# diagnostics.hilog.digests
source: Inspect recorded hashes
zh_hans: 查看已记录哈希

# diagnostics.hilog.sourceDigest
source: Recorded source SHA-256
zh_hans: 已记录来源 SHA-256

# diagnostics.hilog.toolDigest
source: Recorded analyzer SHA-256
zh_hans: 已记录分析器 SHA-256

# diagnostics.hilog.outputDigest
source: Analyzer output SHA-256
zh_hans: 分析器输出 SHA-256

# diagnostics.hilog.artifactDigest
source: Verified summary Artifact SHA-256
zh_hans: 已核验摘要 Artifact SHA-256

# diagnostics.capture.duration
source: Maximum recording
zh_hans: 最长录制

# diagnostics.capture.stop
source: Stop and save
zh_hans: 停止并保存

# diagnostics.capture.cancelPreparation
source: Cancel preparation
zh_hans: 取消准备

# diagnostics.capture.refresh
source: Refresh status
zh_hans: 刷新状态

# diagnostics.capture.marks
source: Markers
zh_hans: 标记

# diagnostics.capture.chooseTarget
source: Adopt one device to start a session.
zh_hans: 绑定一台设备后开始采集。

# diagnostics.capture.uncertain
source: Session state is uncertain. Refresh or inspect this Job in History before starting another capture.
zh_hans: 会话状态不确定。请刷新状态或在 History 查看此 Job，再决定后续操作。

# diagnostics.capture.boundary
source: Bounded trace with host-timed markers; logs drain after capture. Markers have no screenshots or device-clock calibration. Recording stops at its Runtime deadline even if this view closes.
zh_hans: 有界 Trace 采集，标记使用主机时间；日志在录制后读取。标记不含截图，也未与设备时钟校准。关闭页面后，Runtime 仍会按时限停止录制。

# diagnostics.capture.state.preparing
source: Preparing
zh_hans: 准备中

# diagnostics.capture.state.recording
source: Recording
zh_hans: 录制中

# diagnostics.capture.state.finalizing
source: Saving
zh_hans: 保存中

# diagnostics.capture.state.interrupted
source: Interrupted · outcome needs inspection
zh_hans: 已中断 · 请检查结果

# diagnostics.capture.state.closed
source: Session ended
zh_hans: 会话已结束

# diagnostics.capture.phase.checking
source: Checking device and storage
zh_hans: 检查设备和存储空间

# diagnostics.capture.phase.submitting
source: Submitting session
zh_hans: 提交采集

# diagnostics.capture.phase.active
source: Waiting for Runtime
zh_hans: 等待 Runtime

# diagnostics.capture.phase.finished
source: Session ended
zh_hans: 会话已结束

# diagnostics.capture.phase.unavailable
source: Unable to start this session
zh_hans: 无法开始此次采集

# diagnostics.capture.phase.uncertain
source: Session state is uncertain
zh_hans: 会话状态不确定

# diagnostics.alignment.observedWindow
source: Clock observation window: {milliseconds} ms. Cross-clock accuracy still needs validation.
zh_hans: 时钟测量窗口：{milliseconds} ms。跨时钟误差仍待验证。

# diagnostics.alignment.clockDiscontinuity
source: The host clock changed during measurement. This observation cannot align the tracks.
zh_hans: 测量期间主机时间发生跳变，不能据此对齐轨道。
